export const firebaseConfig = {
    apiKey: "AIzaSyBQ_7DC07mQSC0QKJXrZw_HRVn87U9a1hc",
    authDomain: "w-program.firebaseapp.com",
    projectId: "w-program",
    storageBucket: "w-program.firebasestorage.app",
    messagingSenderId: "303408238032",
    appId: "1:303408238032:web:9d64cdf1a7069b2e3c3dd5",
    measurementId: "G-HRLZJEX2PM",
  };
  
  export const defaultRoles = [
    "반장", "부반장", "아침 시간 관리자", "행감바, 인사약 지킴이", "학습&숙제 관리자 (남)",
    "학습&숙제 관리자 (여)", "쉬는 시간 정리 지킴이 A", "쉬는 시간 정리 지킴이 B",
    "테크 매니저 A", "테크 매니저 B", "우편 배달부", "창틀 환경 요정 A", "창틀 환경 요정 B",
    "청소함 관리자 A", "청소함 관리자 B", "쓰레기통 관리자", "분리수거 전문가 A",
    "분리수거 전문가 B", "에너지 보안관", "우유 지킴이", "급식 시간 질서 지킴이 A",
    "급식 시간 질서 지킴이 B", "도서정리인 A", "도서정리인 B", "도서 관리인",
  ];
  
  export const realNames = [
    "가동민", "김선유", "김수형", "김예원", "김용훈", "김원준", "김주아", "김찬우",
    "김하영", "문서우", "박찬", "배한민", "유선재", "윤재익", "이다인", "이서이",
    "이서희", "이채연", "이혜강", "정지수", "조수아", "조이환", "최지완", "한민종", "홍아영",
  ];
  
  export const defaultSilverRewards = {
    10: "간식 1개", 20: "자리 우선 선택권", 30: "숙제 면제권 1회", 40: "음료수 교환권",
    50: "자유시간 10분", 60: "음악 신청권", 70: "보드게임 1회권", 80: "선생님과 산책",
    90: "영화 감상권(개인)", 100: "문화상품권 5천원",
  };
  
  export const defaultGoldRewards = {
    10: "체육시간 10분 연장", 20: "점심시간 10분 연장", 30: "학급 보드게임 1시간",
    40: "아이스크림 파티", 50: "영화 감상 (1교시)", 60: "피자 파티", 70: "숙제 없는 날",
    80: "체육대회", 90: "야외 수업", 100: "과자 파티 및 자율활동",
  };